```
Terraform will perform the following actions:

  # module.aft_pipeline.module.aft_account_request_framework.aws_security_group.aft_vpc_endpoint_sg will be destroyed
  # (because aws_security_group.aft_vpc_endpoint_sg is not in configuration)
  - resource "aws_security_group" "aft_vpc_endpoint_sg" {
      - arn                    = "arn:aws:ec2:eu-central-1:307330981145:security-group/sg-0aacddc6c2ce5a18d" -> null
      - description            = "Allow inbound HTTPS traffic and all Outbound" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow outbound traffic to internet"
              - from_port        = 0
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0aacddc6c2ce5a18d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "192.168.0.0/22",
                ]
              - description      = "Allow inbound SSH"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "192.168.0.0/22",
                ]
              - description      = "Allow inbound TLS"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "aft-endpoint-sg" -> null
      - owner_id               = "307330981145" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "managed_by" = "AFT"
        } -> null
      - vpc_id                 = "vpc-0dd44776a133f05d5" -> null
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-default-sg.aws_security_group.default[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_security_group.aft_vpc_default_sg)
  ~ resource "aws_security_group" "default" {
        id                     = "sg-0928872a27eff1395"
        name                   = "aft-default-sg"
      ~ tags                   = {
          + "Name" = "aft-default-sg"
        }
      ~ tags_all               = {
          + "Name"       = "aft-default-sg"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-default-sg.aws_security_group_rule.dbc["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = "sg-0928872a27eff1395"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc.aws_internet_gateway.default[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_internet_gateway.aft-vpc-igw)
  ~ resource "aws_internet_gateway" "default" {
        id       = "igw-008061751babae454"
      ~ tags     = {
          ~ "Name" = "aft-vpc-igw" -> "aft-management-vpc"
        }
      ~ tags_all = {
          ~ "Name"       = "aft-vpc-igw" -> "aft-management-vpc"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.aws_vpc.aft_vpc has moved to module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc.aws_vpc.default[0]
    resource "aws_vpc" "default" {
        id                                   = "vpc-0dd44776a133f05d5"
        tags                                 = {
            "Name" = "aft-management-vpc"
        }
        # (17 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_eip.default[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_eip.aft-vpc-natgw-01)
  ~ resource "aws_eip" "default" {
        id                   = "eipalloc-0aa451feb837bdc6c"
      ~ tags                 = {
          + "Attributes" = "nat"
          + "Name"       = "aft-vpc-nat-euc1a"
        }
      ~ tags_all             = {
          + "Attributes" = "nat"
          + "Name"       = "aft-vpc-nat-euc1a"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_eip.default[1] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_eip.aft-vpc-natgw-02)
  ~ resource "aws_eip" "default" {
        id                   = "eipalloc-05b4ae126c06caf4e"
      ~ tags                 = {
          + "Attributes" = "nat"
          + "Name"       = "aft-vpc-nat-euc1b"
        }
      ~ tags_all             = {
          + "Attributes" = "nat"
          + "Name"       = "aft-vpc-nat-euc1b"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_nat_gateway.default[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_nat_gateway.aft-vpc-natgw-01)
  ~ resource "aws_nat_gateway" "default" {
        id                   = "nat-0f209a202b3257b24"
      ~ tags                 = {
          + "Attributes" = "nat"
          ~ "Name"       = "aft-vpc-natgw-01" -> "aft-vpc-nat-euc1a"
        }
      ~ tags_all             = {
          + "Attributes" = "nat"
          ~ "Name"       = "aft-vpc-natgw-01" -> "aft-vpc-nat-euc1a"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_nat_gateway.default[1] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_nat_gateway.aft-vpc-natgw-02)
  ~ resource "aws_nat_gateway" "default" {
        id                   = "nat-0e649cf9fa73dc307"
      ~ tags                 = {
          + "Attributes" = "nat"
          ~ "Name"       = "aft-vpc-natgw-02" -> "aft-vpc-nat-euc1b"
        }
      ~ tags_all             = {
          + "Attributes" = "nat"
          ~ "Name"       = "aft-vpc-natgw-02" -> "aft-vpc-nat-euc1b"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route.nat4[0] will be created
  + resource "aws_route" "nat4" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-0f209a202b3257b24"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0bb613a8faac2c6a9"
      + state                  = (known after apply)

      + timeouts {}
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route.nat4[1] will be created
  + resource "aws_route" "nat4" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-0e649cf9fa73dc307"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0fe2cc200d7b76bb8"
      + state                  = (known after apply)

      + timeouts {}
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route.public[0] will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = "igw-008061751babae454"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0bd24abecc6d7f447"
      + state                  = (known after apply)

      + timeouts {}
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route_table.private[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_route_table.aft_vpc_private_subnet_01)
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0bb613a8faac2c6a9"
      ~ tags             = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-01" -> "aft-vpc-private-euc1a"
        }
      ~ tags_all         = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-01" -> "aft-vpc-private-euc1a"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route_table.private[1] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_route_table.aft_vpc_private_subnet_02)
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0fe2cc200d7b76bb8"
      ~ tags             = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-02" -> "aft-vpc-private-euc1b"
        }
      ~ tags_all         = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-02" -> "aft-vpc-private-euc1b"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route_table.public[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_route_table.aft_vpc_public_subnet_01)
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0bd24abecc6d7f447"
      ~ tags             = {
          + "Attributes" = "public"
          ~ "Name"       = "aft-vpc-public-subnet-01" -> "aft-vpc-public"
        }
      ~ tags_all         = {
          + "Attributes" = "public"
          ~ "Name"       = "aft-vpc-public-subnet-01" -> "aft-vpc-public"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.aws_route_table_association.aft_vpc_private_subnet_01 has moved to module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route_table_association.private[0]
    resource "aws_route_table_association" "private" {
        id             = "rtbassoc-00fe25a5151db8b24"
        # (2 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.aws_route_table_association.aft_vpc_private_subnet_02 has moved to module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route_table_association.private[1]
    resource "aws_route_table_association" "private" {
        id             = "rtbassoc-0fc8ac28a271db551"
        # (2 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.aws_route_table_association.aft_vpc_public_subnet_01 has moved to module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route_table_association.public[0]
    resource "aws_route_table_association" "public" {
        id             = "rtbassoc-0ecf667a5941c1bfc"
        # (2 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.aws_route_table_association.aft_vpc_public_subnet_02 has moved to module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_route_table_association.public[1]
    resource "aws_route_table_association" "public" {
        id             = "rtbassoc-0751480dcf58ba955"
        # (2 unchanged attributes hidden)
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_subnet.private[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_subnet.aft_vpc_private_subnet_01)
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0cb0a14749611c33c"
      ~ tags                                           = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-01" -> "aft-vpc-private-euc1a"
        }
      ~ tags_all                                       = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-01" -> "aft-vpc-private-euc1a"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

      + timeouts {}
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_subnet.private[1] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_subnet.aft_vpc_private_subnet_02)
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-00ff86a48d0d1053b"
      ~ tags                                           = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-02" -> "aft-vpc-private-euc1b"
        }
      ~ tags_all                                       = {
          + "Attributes" = "private"
          ~ "Name"       = "aft-vpc-private-subnet-02" -> "aft-vpc-private-euc1b"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

      + timeouts {}
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_subnet.public[0] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_subnet.aft_vpc_public_subnet_01)
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0c7bf9baf7146928f"
      ~ tags                                           = {
          + "Attributes" = "public"
          ~ "Name"       = "aft-vpc-public-subnet-01" -> "aft-vpc-public-euc1a"
        }
      ~ tags_all                                       = {
          + "Attributes" = "public"
          ~ "Name"       = "aft-vpc-public-subnet-01" -> "aft-vpc-public-euc1a"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

      + timeouts {}
    }

  # module.aft_pipeline.module.aft_account_request_framework.module.aft-vpc-subnets.aws_subnet.public[1] will be updated in-place
  # (moved from module.aft_pipeline.module.aft_account_request_framework.aws_subnet.aft_vpc_public_subnet_02)
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-070d093f006ffd98f"
      ~ tags                                           = {
          + "Attributes" = "public"
          ~ "Name"       = "aft-vpc-public-subnet-02" -> "aft-vpc-public-euc1b"
        }
      ~ tags_all                                       = {
          + "Attributes" = "public"
          ~ "Name"       = "aft-vpc-public-subnet-02" -> "aft-vpc-public-euc1b"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)

      + timeouts {}
    }

Plan: 4 to add, 13 to change, 1 to destroy.
```